package dev.seabat.android.shinobuetuner.utils.MusicalScale

/**
 * TODO
 *
 * @property tuneScale 六本調子(B♭)の相対音高 ♭#
 * @property absoluteScale ピアノ鍵盤の絶対音高
 * @property level
 */
enum class MusicalScaleType(val tuneScale: String, val absoluteScale: String, val level: Int) {
    B2("", "B", 2),
    C3("レ", "C", 3),
    Cs3("", "C#", 3),
    D3("ミ", "D", 3),
    Ds3("ファ", "D#", 3),
    E3("", "E", 3),
    F3("ソ", "F", 3),
    Fs3("", "F#", 3),
    G3("ラ", "G", 3),
    Gs3("", "G#", 3),
    A3("シ", "A", 3),

    As3("ド", "A#", 3),
    B3("", "B3", 3),
    C4("レ", "C", 4),
    Cs4("", "C#", 4),
    D4("ミ", "D", 4),
    Ds4("ファ", "D#", 4),
    E4("", "E", 4),
    F4("ソ", "F", 4),
    Fs4("", "F#", 4),
    G4("ラ", "G", 4),
    Gs4("", "G#", 4),
    A4("シ", "A", 4),

    As4("ド", "A#", 4),
    B4("", "B", 4),
    C5("レ", "C", 5),
    Cs5("", "C#", 5),
    D5("ミ", "D", 5),
    Ds5("ファ", "D#", 5),
    E5("", "E", 5),
    F5("ソ", "F", 5),
    Fs5("", "F#", 5),
    G5("ラ", "G", 5),
    Gs5("", "G#", 5),
    A5("シ", "A", 5),

    As5("ド", "A#", 5),
    B5("", "B", 5),
    C6("レ", "C", 6),
    Cs6("", "C#", 6),
    D6("ミ", "D", 6),
    Ds6("ファ", "D#", 6),
    E6("", "E", 6),
    F6("ソ", "F", 6),
    Fs6("", "F#", 6),
    G6("ラ", "G", 6),
    Gs6("", "G#", 6),
    A6("シ", "A", 6),

    As6("ド", "A#", 6),
    B6("", "B", 6),
    C7("レ", "C", 7),
    Cs7("", "C#", 7),
    D7("ミ", "D", 7),
    Ds7("ファ", "D#", 7),
    E7("", "E", 7),
    F7("ソ", "F", 7),
    Fs7("", "F#", 7),
    G7("ラ", "G", 7),
    Gs7("", "G#", 7),
    A7("シ", "A", 7),

    As7("ド", "A#", 7),
    B7("", "B", 7),
    C8("レ", "C", 8),
    Cs8("", "C#", 8),
    D8("ミ", "D", 8),
    Ds8("ファ", "D#", 8),
    E8("", "E", 8),
    F8("ソ", "F", 8),
    Fs8("", "F#", 8),
    G8("ラ", "G", 8),
    Gs8("", "G#", 8),
    A8("シ", "A", 8),

    As8("ド", "A#", 8),

    UNKNOWN("", "", 0),
}